START_MESSAGE_TEXT = "👋 Привет, Я - бот помощник по новому кампусу ИРИТ РТФ УрФУ."

START_KEYBOARD_DICT = {
    "🏢 Арендовать коворкинг": "coworking",
    "🔗 Ссылки на чаты НВК": "nvk_links",
    "🙋‍♂️ Отметиться на паре": "check_in",
    "⚠️ Ой, тут что-то сломалось": "report"
}

MENU_BTN_TEXT = "🔙Меню"
MENU_BTN_CALLBACK = "menu"


COWORKING_TEXT = """<b>🏢 Аренда коворкинга</b>

Отличное решение! Продуктивная работа начинается с удобного места. 💻

Выбери из списка ниже, какой коворкинг ты хочешь забронировать, и я моментально закреплю его за тобой."""


NVK_LINKS_TEXT = """<b>🔗 Ссылки на чаты НВК</b>

Будь в курсе всех событий и новостей! Присоединяйся к нашим официальным чатам, чтобы ничего не пропустить.

<b>📢 Главный канал кампуса:</b>
https://t.me/urfu_campus

Здесь ты найдешь всю самую важную информацию, анонсы мероприятий и объявления.
"""


CHECK_IN_TEXT = """<b>🙋‍♂️ Как отметиться на паре?</b>

Все просто, как дважды два! Чтобы система тебя засчитала, следуй этой инструкции:

1️⃣ Приходи на пару и наведи камеру на QR-код на экране у преподавателя.
2️⃣ Ссылка автоматически откроет диалог со мной, и я отмечу твое присутствие.
3️⃣ Готово! Ты отмечен. 🎉 Больше ничего делать не нужно.
"""


REPORT_TEXT = """<b>⚠️ Что-то сломалось? Я помогу!</b>

Нашел неисправность, что-то не работает или просто выглядит не так, как должно? Не беда!
Сообщи мне, и я оперативно передам твое обращение ответственным сотрудникам. 🛠️

Чтобы я мог помочь, пожалуйста, отправь мне <b>фотографию поломки и комментарий при желании. 📸</b>

Чем нагляднее будет фото, тем быстрее мы сможем все исправить!
"""


HELP_MESSAGE_TEXT = "Здесь будет информация для команды хэлп"


SOME_MESSAGE_TEXT = """
К сожалению, я тебя не понимаю.
Воспользуйся кнопками в меню или вызови режим ИИ(команда /ai_mode)"""


AI_CHOICE_TEXT = """
Теперь ты можешь задать мне вопросы по кампусу УрФУ в свободной форме, а я отвечу на них!"""
