START_MESSAGE_TEXT = "👋 Привет, Я - бот помощник по новому кампусу ИРИТ РТФ УрФУ."

START_KEYBOARD_DICT = {
    "🏢 Арендовать коворкинг": "coworking",
    "🔗 Ссылки на чаты НВК": "nvk_links",
    "🙋‍♂️ Отметиться на паре": "check_in",
    "⚠️ Ой, тут что-то сломалось": "report"
}



HELP_MESSAGE_TEXT = "Здесь будет информация для команды хэлп"


SOME_MESSAGE_TEXT = """
К сожалению, я тебя не понимаю.
Воспользуйся кнопками в меню или вызови режим ИИ(команда /ai_mode)"""


AI_CHOICE_TEXT = """
Теперь ты можешь задать мне вопросы по кампусу УрФУ в свободной форме, а я отвечу на них!"""
